app/controllers/tabflowers_controller.rb

SELECT COUNT(*) FROM `tabflowers`
SELECT `tabflowers`.* FROM `tabflowers` LIMIT 1 OFFSET 0
---
  def index
#    @tabflowers = Tabflower.all
#     @tabflowers=Tabflower.paginate :page =>1, :per_page => 1
    @tabflowers=Tabflower.paginate :page => params[:page], :per_page => 9

SELECT `tabflowers`.* FROM `tabflowers` WHERE (`tabflowers`.`id` = 6) LIMIT 1
---
  def show
 @tabuser=session[:tabuser]
    @tabflower = Tabflower.find(params[:id])

SELECT `tabflowers`.* FROM `tabflowers` WHERE `tabflowers`.`id` = 1 LIMIT 1
---
  def edit
    @tabflower = Tabflower.find(params[:id])

INSERT INTO `tabflowers` (`fName`, `fHanyi`, `fSPrice`, `fImg`, `fDetails`, `fCailiao`, `fBaoZ`, `fPprice`) VALUES ('', '', NULL, '', '', '', '', NULL)
---
  def create
     @tabuser=session[:tabuser]
    if @tabuser!=nil then
    @tabflower = Tabflower.new(params[:tabflower])
    respond_to do |format|
      if @tabflower.save

SELECT `tabflowers`.* FROM `tabflowers` WHERE (`tabflowers`.`id` = 6) LIMIT 1
---
  def addcart
    @tabuser=session[:tabuser]
    if @tabuser!=nil then
    tabflower=Tabflower.find(params[:id])

SELECT `tabflowers`.* FROM `tabflowers` WHERE (`tabflowers`.`id` = 6) LIMIT 1
---
  def deleteFlower
    id=params[:id]
    @tabuser=session[:tabuser]
    if @tabuser!=nil then
    tabflower=Tabflower.find(params[:id])