app/controllers/tabusers_controller.rb

  def login
     uname=params[:tabuser][:uName]
     upass=params[:tabuser][:uPass]
     session[:tabuser]=nil
     user=Tabuser.find_by_uName_and_uPass(uname,upass)
---
SELECT `tabusers`.* FROM `tabusers` WHERE (`tabusers`.`uName` = 'dcy') AND (`tabusers`.`uPass` = 'dcy') LIMIT 1

  def registerUser
    @new_user=Tabuser.new()
    @new_user.uName=params[:tabuser][:name]
    @new_user.uPass=params[:tabuser][:pass]
    @new_user.uTname=params[:tabuser][:tname]
    @new_user.uAddress=params[:tabuser][:address]
    @new_user.uCode=params[:tabuser][:code]
    @new_user.uPhone=params[:tabuser][:phone]
    @new_user.uEmail=params[:tabuser][:email]
    @new_user.uAddressType=params[:tabuser][:type]
    if @new_user.save
---
INSERT INTO `tabusers` (`uName`, `uPass`, `uTname`, `uAddress`, `uCode`, `uPhone`, `uEmail`, `uAddressType`) VALUES ('dcy', 'dcy', 'dcy', '撒地方水电费', '4960000', '112222222', 'sdfsdf', 'sadfsdf')